jmeter/stress-test-login/stress-test-login-result/statistics.json
{
  "http://localhost:3000/api/v1/category/get-category" : {
    "transaction" : "http://localhost:3000/api/v1/category/get-category",
    "sampleCount" : 5420,
    "errorCount" : 132,
    "errorPct" : 2.4354243,
    "meanResTime" : 3412.9023985239855,
    "medianResTime" : 3751.0,
    "minResTime" : 12.0,
    "maxResTime" : 7845.0,
    "pct1ResTime" : 4962.0,
    "pct2ResTime" : 5066.0,
    "pct3ResTime" : 5551.79,
    "throughput" : 53.980300178274426,
    "receivedKBytesPerSec" : 25.53020340028584,
    "sentKBytesPerSec" : 26.110916071588637
  },
  "http://localhost:3000/api/v1/product/product-list/1" : {
    "transaction" : "http://localhost:3000/api/v1/product/product-list/1",
    "sampleCount" : 2555,
    "errorCount" : 55,
    "errorPct" : 2.1526418,
    "meanResTime" : 3466.6105675146778,
    "medianResTime" : 3889.0,
    "minResTime" : 13.0,
    "maxResTime" : 7984.0,
    "pct1ResTime" : 4980.0,
    "pct2ResTime" : 5035.0,
    "pct3ResTime" : 5118.88,
    "throughput" : 25.473071324599708,
    "receivedKBytesPerSec" : 10.12922419605292,
    "sentKBytesPerSec" : 11.756487594963211
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 13421,
    "errorCount" : 334,
    "errorPct" : 2.4886372,
    "meanResTime" : 3493.5059980627316,
    "medianResTime" : 3869.0,
    "minResTime" : 12.0,
    "maxResTime" : 9135.0,
    "pct1ResTime" : 5020.800000000001,
    "pct2ResTime" : 5209.0,
    "pct3ResTime" : 5694.780000000001,
    "throughput" : 133.37242119489605,
    "receivedKBytesPerSec" : 67.29305391826827,
    "sentKBytesPerSec" : 65.69491639379696
  },
  "http://localhost:3000/api/v1/product/product-count" : {
    "transaction" : "http://localhost:3000/api/v1/product/product-count",
    "sampleCount" : 2612,
    "errorCount" : 57,
    "errorPct" : 2.1822357,
    "meanResTime" : 3459.460566615613,
    "medianResTime" : 3922.5,
    "minResTime" : 14.0,
    "maxResTime" : 8864.0,
    "pct1ResTime" : 4978.0,
    "pct2ResTime" : 5031.0,
    "pct3ResTime" : 5118.87,
    "throughput" : 26.033828029223272,
    "receivedKBytesPerSec" : 10.26517266909031,
    "sentKBytesPerSec" : 11.986788573571477
  },
  "http://localhost:3000/api/v1/auth/login" : {
    "transaction" : "http://localhost:3000/api/v1/auth/login",
    "sampleCount" : 2834,
    "errorCount" : 90,
    "errorPct" : 3.1757233,
    "meanResTime" : 3703.285815102329,
    "medianResTime" : 4126.5,
    "minResTime" : 58.0,
    "maxResTime" : 9135.0,
    "pct1ResTime" : 5380.5,
    "pct2ResTime" : 5593.25,
    "pct3ResTime" : 5977.100000000001,
    "throughput" : 28.164255048497374,
    "receivedKBytesPerSec" : 21.48848994772619,
    "sentKBytesPerSec" : 15.972169599200987
  }
}